HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxSrc_reg.h
/** \brief A08, General Purpose Group 3 Service Request 6 */
#define SRC_GPSR_GPSR3_SR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A08u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR6.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR6.
*/
#define SRC_GPSR36 (SRC_GPSR_GPSR3_SR6)

/** \brief A0C, General Purpose Group 3 Service Request 7 */
#define SRC_GPSR_GPSR3_SR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A0Cu)
/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR7.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR7.
*/
#define SRC_GPSR37 (SRC_GPSR_GPSR3_SR7)

/** \brief A50, ASCLIN14 Transmit Service Request */
#define SRC_ASCLIN14_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A50u)
/** Alias (User Manual Name) for SRC_ASCLIN14_TX.
* To use register names with standard convension, please use SRC_ASCLIN14_TX.
*/
#define SRC_ASCLIN14TX (SRC_ASCLIN14_TX)

/** \brief A54, ASCLIN14 Receive Service Request */
#define SRC_ASCLIN14_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A54u)
/** Alias (User Manual Name) for SRC_ASCLIN14_RX.
* To use register names with standard convension, please use SRC_ASCLIN14_RX.
*/
#define SRC_ASCLIN14RX (SRC_ASCLIN14_RX)

/** \brief A58, ASCLIN14 Error Service Request */
#define SRC_ASCLIN14_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A58u)
/** Alias (User Manual Name) for SRC_ASCLIN14_ERR.
* To use register names with standard convension, please use SRC_ASCLIN14_ERR.
*/
#define SRC_ASCLIN14ERR (SRC_ASCLIN14_ERR)

/** \brief A5C, ASCLIN15 Transmit Service Request */
#define SRC_ASCLIN15_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A5Cu)
/** Alias (User Manual Name) for SRC_ASCLIN15_TX.
* To use register names with standard convension, please use SRC_ASCLIN15_TX.
*/
#define SRC_ASCLIN15TX (SRC_ASCLIN15_TX)

/** \brief A60, ASCLIN15 Receive Service Request */
#define SRC_ASCLIN15_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A60u)
/** Alias (User Manual Name) for SRC_ASCLIN15_RX.
* To use register names with standard convension, please use SRC_ASCLIN15_RX.
*/
#define SRC_ASCLIN15RX (SRC_ASCLIN15_RX)

/** \brief A64, ASCLIN15 Error Service Request */
#define SRC_ASCLIN15_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A64u)
/** Alias (User Manual Name) for SRC_ASCLIN15_ERR.
* To use register names with standard convension, please use SRC_ASCLIN15_ERR.
*/
#define SRC_ASCLIN15ERR (SRC_ASCLIN15_ERR)

/** \brief A70, AEI Shared Service Request */
#define SRC_GTM_AEIIRQ /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A70u)
/** Alias (User Manual Name) for SRC_GTM_AEIIRQ.
* To use register names with standard convension, please use SRC_GTM_AEIIRQ.
*/
#define SRC_GTMAEIIRQ (SRC_GTM_AEIIRQ)

/** \brief A74, ARU Shared Service Request 0 */
#define SRC_GTM_ARUIRQ0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A74u)
/** Alias (User Manual Name) for SRC_GTM_ARUIRQ0.
* To use register names with standard convension, please use SRC_GTM_ARUIRQ0.
*/
#define SRC_GTMARUIRQ0 (SRC_GTM_ARUIRQ0)

/** \brief A78, ARU Shared Service Request 1 */
#define SRC_GTM_ARUIRQ1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A78u)
/** Alias (User Manual Name) for SRC_GTM_ARUIRQ1.
* To use register names with standard convension, please use SRC_GTM_ARUIRQ1.
*/
#define SRC_GTMARUIRQ1 (SRC_GTM_ARUIRQ1)

/** \brief A7C, ARU Shared Service Request 2 */
#define SRC_GTM_ARUIRQ2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A7Cu)
/** Alias (User Manual Name) for SRC_GTM_ARUIRQ2.
* To use register names with standard convension, please use SRC_GTM_ARUIRQ2.
*/
#define SRC_GTMARUIRQ2 (SRC_GTM_ARUIRQ2)

/** \brief A80, BRC Shared Service Request */
#define SRC_GTM_BRCIRQ /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A80u)
/** Alias (User Manual Name) for SRC_GTM_BRCIRQ.
* To use register names with standard convension, please use SRC_GTM_BRCIRQ.
*/
#define SRC_GTMBRCIRQ (SRC_GTM_BRCIRQ)

/** \brief A84, CMP Shared Service Request */
#define SRC_GTM_CMBIRQ /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A84u)
/** Alias (User Manual Name) for SRC_GTM_CMBIRQ.
* To use register names with standard convension, please use SRC_GTM_CMBIRQ.
*/
#define SRC_GTMCMPIRQ (SRC_GTM_CMBIRQ)

/** \brief A88, SPE0 Shared Service Request */
#define SRC_GTM_SPEIRQ0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A88u)
/** Alias (User Manual Name) for SRC_GTM_SPEIRQ0.
* To use register names with standard convension, please use SRC_GTM_SPEIRQ0.
*/
#define SRC_GTMSPE0IRQ (SRC_GTM_SPEIRQ0)

/** \brief A8C, SPE1 Shared Service Request */
#define SRC_GTM_SPEIRQ1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A8Cu)
/** Alias (User Manual Name) for SRC_GTM_SPEIRQ1.
* To use register names with standard convension, please use SRC_GTM_SPEIRQ1.
*/
#define SRC_GTMSPE1IRQ (SRC_GTM_SPEIRQ1)

/** \brief A90, SPE2 Shared Service Request */
#define SRC_GTM_SPEIRQ2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A90u)
/** Alias (User Manual Name) for SRC_GTM_SPEIRQ2.
* To use register names with standard convension, please use SRC_GTM_SPEIRQ2.
*/
#define SRC_GTMSPE2IRQ (SRC_GTM_SPEIRQ2)

/** \brief A94, SPE3 Shared Service Request */
#define SRC_GTM_SPEIRQ3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A94u)
/** Alias (User Manual Name) for SRC_GTM_SPEIRQ3.
* To use register names with standard convension, please use SRC_GTM_SPEIRQ3.
*/
#define SRC_GTMSPE3IRQ (SRC_GTM_SPEIRQ3)

/** \brief AA0, PSM0 Shared Service Request 0 */
#define SRC_GTM_PSM0_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AA0u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_0.
* To use register names with standard convension, please use SRC_GTM_PSM0_0.
*/
#define SRC_GTMPSM00 (SRC_GTM_PSM0_0)

/** \brief AA4, PSM0 Shared Service Request 1 */
#define SRC_GTM_PSM0_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AA4u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_1.
* To use register names with standard convension, please use SRC_GTM_PSM0_1.
*/
#define SRC_GTMPSM01 (SRC_GTM_PSM0_1)

/** \brief AA8, PSM0 Shared Service Request 2 */
#define SRC_GTM_PSM0_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AA8u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_2.
* To use register names with standard convension, please use SRC_GTM_PSM0_2.
*/
#define SRC_GTMPSM02 (SRC_GTM_PSM0_2)

/** \brief AAC, PSM0 Shared Service Request 3 */
#define SRC_GTM_PSM0_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AACu)
/** Alias (User Manual Name) for SRC_GTM_PSM0_3.
* To use register names with standard convension, please use SRC_GTM_PSM0_3.
*/
#define SRC_GTMPSM03 (SRC_GTM_PSM0_3)

