HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxSrc_reg.h
/** \brief D38, MCS4 Shared Service Request 2 */
#define SRC_GTM_MCS4_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D38u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_2.
* To use register names with standard convension, please use SRC_GTM_MCS4_2.
*/
#define SRC_GTMMCS42 (SRC_GTM_MCS4_2)

/** \brief D3C, MCS4 Shared Service Request 3 */
#define SRC_GTM_MCS4_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D3Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS4_3.
* To use register names with standard convension, please use SRC_GTM_MCS4_3.
*/
#define SRC_GTMMCS43 (SRC_GTM_MCS4_3)

/** \brief D40, MCS4 Shared Service Request 4 */
#define SRC_GTM_MCS4_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D40u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_4.
* To use register names with standard convension, please use SRC_GTM_MCS4_4.
*/
#define SRC_GTMMCS44 (SRC_GTM_MCS4_4)

/** \brief D44, MCS4 Shared Service Request 5 */
#define SRC_GTM_MCS4_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D44u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_5.
* To use register names with standard convension, please use SRC_GTM_MCS4_5.
*/
#define SRC_GTMMCS45 (SRC_GTM_MCS4_5)

/** \brief D48, MCS4 Shared Service Request 6 */
#define SRC_GTM_MCS4_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D48u)
/** Alias (User Manual Name) for SRC_GTM_MCS4_6.
* To use register names with standard convension, please use SRC_GTM_MCS4_6.
*/
#define SRC_GTMMCS46 (SRC_GTM_MCS4_6)

/** \brief D4C, MCS4 Shared Service Request 7 */
#define SRC_GTM_MCS4_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D4Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS4_7.
* To use register names with standard convension, please use SRC_GTM_MCS4_7.
*/
#define SRC_GTMMCS47 (SRC_GTM_MCS4_7)

/** \brief D50, MCS5 Shared Service Request 0 */
#define SRC_GTM_MCS5_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D50u)
/** Alias (User Manual Name) for SRC_GTM_MCS5_0.
* To use register names with standard convension, please use SRC_GTM_MCS5_0.
*/
#define SRC_GTMMCS50 (SRC_GTM_MCS5_0)

/** \brief D54, MCS5 Shared Service Request 1 */
#define SRC_GTM_MCS5_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D54u)
/** Alias (User Manual Name) for SRC_GTM_MCS5_1.
* To use register names with standard convension, please use SRC_GTM_MCS5_1.
*/
#define SRC_GTMMCS51 (SRC_GTM_MCS5_1)

/** \brief D58, MCS5 Shared Service Request 2 */
#define SRC_GTM_MCS5_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D58u)
/** Alias (User Manual Name) for SRC_GTM_MCS5_2.
* To use register names with standard convension, please use SRC_GTM_MCS5_2.
*/
#define SRC_GTMMCS52 (SRC_GTM_MCS5_2)

/** \brief D5C, MCS5 Shared Service Request 3 */
#define SRC_GTM_MCS5_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D5Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS5_3.
* To use register names with standard convension, please use SRC_GTM_MCS5_3.
*/
#define SRC_GTMMCS53 (SRC_GTM_MCS5_3)

/** \brief D60, MCS5 Shared Service Request 4 */
#define SRC_GTM_MCS5_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D60u)
/** Alias (User Manual Name) for SRC_GTM_MCS5_4.
* To use register names with standard convension, please use SRC_GTM_MCS5_4.
*/
#define SRC_GTMMCS54 (SRC_GTM_MCS5_4)

/** \brief D64, MCS5 Shared Service Request 5 */
#define SRC_GTM_MCS5_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D64u)
/** Alias (User Manual Name) for SRC_GTM_MCS5_5.
* To use register names with standard convension, please use SRC_GTM_MCS5_5.
*/
#define SRC_GTMMCS55 (SRC_GTM_MCS5_5)

/** \brief D68, MCS5 Shared Service Request 6 */
#define SRC_GTM_MCS5_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D68u)
/** Alias (User Manual Name) for SRC_GTM_MCS5_6.
* To use register names with standard convension, please use SRC_GTM_MCS5_6.
*/
#define SRC_GTMMCS56 (SRC_GTM_MCS5_6)

/** \brief D6C, MCS5 Shared Service Request 7 */
#define SRC_GTM_MCS5_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D6Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS5_7.
* To use register names with standard convension, please use SRC_GTM_MCS5_7.
*/
#define SRC_GTMMCS57 (SRC_GTM_MCS5_7)

/** \brief D70, MCS6 Shared Service Request 0 */
#define SRC_GTM_MCS6_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D70u)
/** Alias (User Manual Name) for SRC_GTM_MCS6_0.
* To use register names with standard convension, please use SRC_GTM_MCS6_0.
*/
#define SRC_GTMMCS60 (SRC_GTM_MCS6_0)

/** \brief D74, MCS6 Shared Service Request 1 */
#define SRC_GTM_MCS6_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D74u)
/** Alias (User Manual Name) for SRC_GTM_MCS6_1.
* To use register names with standard convension, please use SRC_GTM_MCS6_1.
*/
#define SRC_GTMMCS61 (SRC_GTM_MCS6_1)

/** \brief D78, MCS6 Shared Service Request 2 */
#define SRC_GTM_MCS6_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D78u)
/** Alias (User Manual Name) for SRC_GTM_MCS6_2.
* To use register names with standard convension, please use SRC_GTM_MCS6_2.
*/
#define SRC_GTMMCS62 (SRC_GTM_MCS6_2)

/** \brief D7C, MCS6 Shared Service Request 3 */
#define SRC_GTM_MCS6_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D7Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS6_3.
* To use register names with standard convension, please use SRC_GTM_MCS6_3.
*/
#define SRC_GTMMCS63 (SRC_GTM_MCS6_3)

/** \brief D80, MCS6 Shared Service Request 4 */
#define SRC_GTM_MCS6_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D80u)
/** Alias (User Manual Name) for SRC_GTM_MCS6_4.
* To use register names with standard convension, please use SRC_GTM_MCS6_4.
*/
#define SRC_GTMMCS64 (SRC_GTM_MCS6_4)

/** \brief D84, MCS6 Shared Service Request 5 */
#define SRC_GTM_MCS6_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D84u)
/** Alias (User Manual Name) for SRC_GTM_MCS6_5.
* To use register names with standard convension, please use SRC_GTM_MCS6_5.
*/
#define SRC_GTMMCS65 (SRC_GTM_MCS6_5)

/** \brief D88, MCS6 Shared Service Request 6 */
#define SRC_GTM_MCS6_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D88u)
/** Alias (User Manual Name) for SRC_GTM_MCS6_6.
* To use register names with standard convension, please use SRC_GTM_MCS6_6.
*/
#define SRC_GTMMCS66 (SRC_GTM_MCS6_6)

/** \brief D8C, MCS6 Shared Service Request 7 */
#define SRC_GTM_MCS6_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D8Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS6_7.
* To use register names with standard convension, please use SRC_GTM_MCS6_7.
*/
#define SRC_GTMMCS67 (SRC_GTM_MCS6_7)

/** \brief DF0, ASCLIN18 Transmit Service Request */
#define SRC_ASCLIN18_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DF0u)
/** Alias (User Manual Name) for SRC_ASCLIN18_TX.
* To use register names with standard convension, please use SRC_ASCLIN18_TX.
*/
#define SRC_ASCLIN18TX (SRC_ASCLIN18_TX)

/** \brief DF4, ASCLIN18 Receive Service Request */
#define SRC_ASCLIN18_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DF4u)
/** Alias (User Manual Name) for SRC_ASCLIN18_RX.
* To use register names with standard convension, please use SRC_ASCLIN18_RX.
*/
#define SRC_ASCLIN18RX (SRC_ASCLIN18_RX)

/** \brief DF8, ASCLIN18 Error Service Request */
#define SRC_ASCLIN18_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DF8u)
/** Alias (User Manual Name) for SRC_ASCLIN18_ERR.
* To use register names with standard convension, please use SRC_ASCLIN18_ERR.
*/
#define SRC_ASCLIN18ERR (SRC_ASCLIN18_ERR)

/** \brief DFC, ASCLIN19 Transmit Service Request */
#define SRC_ASCLIN19_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DFCu)
/** Alias (User Manual Name) for SRC_ASCLIN19_TX.
* To use register names with standard convension, please use SRC_ASCLIN19_TX.
*/
#define SRC_ASCLIN19TX (SRC_ASCLIN19_TX)

/** \brief E00, ASCLIN19 Receive Service Request */
#define SRC_ASCLIN19_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E00u)
/** Alias (User Manual Name) for SRC_ASCLIN19_RX.
* To use register names with standard convension, please use SRC_ASCLIN19_RX.
*/
#define SRC_ASCLIN19RX (SRC_ASCLIN19_RX)

/** \brief E04, ASCLIN19 Error Service Request */
#define SRC_ASCLIN19_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E04u)
/** Alias (User Manual Name) for SRC_ASCLIN19_ERR.
* To use register names with standard convension, please use SRC_ASCLIN19_ERR.
*/
#define SRC_ASCLIN19ERR (SRC_ASCLIN19_ERR)

/** \brief E10, TOM0 Shared Service Request 0 */
#define SRC_GTM_TOM0_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E10u)
/** Alias (User Manual Name) for SRC_GTM_TOM0_0.
* To use register names with standard convension, please use SRC_GTM_TOM0_0.
*/
#define SRC_GTMTOM00 (SRC_GTM_TOM0_0)

