HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxSrc_reg.h
/** \brief F48, ATOM5 Shared Service Request 2 */
#define SRC_GTM_ATOM5_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F48u)
/** Alias (User Manual Name) for SRC_GTM_ATOM5_2.
* To use register names with standard convension, please use SRC_GTM_ATOM5_2.
*/
#define SRC_GTMATOM52 (SRC_GTM_ATOM5_2)

/** \brief F4C, ATOM5 Shared Service Request 3 */
#define SRC_GTM_ATOM5_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F4Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM5_3.
* To use register names with standard convension, please use SRC_GTM_ATOM5_3.
*/
#define SRC_GTMATOM53 (SRC_GTM_ATOM5_3)

/** \brief F50, ATOM6 Shared Service Request 0 */
#define SRC_GTM_ATOM6_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F50u)
/** Alias (User Manual Name) for SRC_GTM_ATOM6_0.
* To use register names with standard convension, please use SRC_GTM_ATOM6_0.
*/
#define SRC_GTMATOM60 (SRC_GTM_ATOM6_0)

/** \brief F54, ATOM6 Shared Service Request 1 */
#define SRC_GTM_ATOM6_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F54u)
/** Alias (User Manual Name) for SRC_GTM_ATOM6_1.
* To use register names with standard convension, please use SRC_GTM_ATOM6_1.
*/
#define SRC_GTMATOM61 (SRC_GTM_ATOM6_1)

/** \brief F58, ATOM6 Shared Service Request 2 */
#define SRC_GTM_ATOM6_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F58u)
/** Alias (User Manual Name) for SRC_GTM_ATOM6_2.
* To use register names with standard convension, please use SRC_GTM_ATOM6_2.
*/
#define SRC_GTMATOM62 (SRC_GTM_ATOM6_2)

/** \brief F5C, ATOM6 Shared Service Request 3 */
#define SRC_GTM_ATOM6_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F5Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM6_3.
* To use register names with standard convension, please use SRC_GTM_ATOM6_3.
*/
#define SRC_GTMATOM63 (SRC_GTM_ATOM6_3)

/** \brief F60, ATOM7 Shared Service Request 0 */
#define SRC_GTM_ATOM7_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F60u)
/** Alias (User Manual Name) for SRC_GTM_ATOM7_0.
* To use register names with standard convension, please use SRC_GTM_ATOM7_0.
*/
#define SRC_GTMATOM70 (SRC_GTM_ATOM7_0)

/** \brief F64, ATOM7 Shared Service Request 1 */
#define SRC_GTM_ATOM7_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F64u)
/** Alias (User Manual Name) for SRC_GTM_ATOM7_1.
* To use register names with standard convension, please use SRC_GTM_ATOM7_1.
*/
#define SRC_GTMATOM71 (SRC_GTM_ATOM7_1)

/** \brief F68, ATOM7 Shared Service Request 2 */
#define SRC_GTM_ATOM7_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F68u)
/** Alias (User Manual Name) for SRC_GTM_ATOM7_2.
* To use register names with standard convension, please use SRC_GTM_ATOM7_2.
*/
#define SRC_GTMATOM72 (SRC_GTM_ATOM7_2)

/** \brief F6C, ATOM7 Shared Service Request 3 */
#define SRC_GTM_ATOM7_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F6Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM7_3.
* To use register names with standard convension, please use SRC_GTM_ATOM7_3.
*/
#define SRC_GTMATOM73 (SRC_GTM_ATOM7_3)

/** \brief F70, ATOM8 Shared Service Request 0 */
#define SRC_GTM_ATOM8_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F70u)
/** Alias (User Manual Name) for SRC_GTM_ATOM8_0.
* To use register names with standard convension, please use SRC_GTM_ATOM8_0.
*/
#define SRC_GTMATOM80 (SRC_GTM_ATOM8_0)

/** \brief F74, ATOM8 Shared Service Request 1 */
#define SRC_GTM_ATOM8_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F74u)
/** Alias (User Manual Name) for SRC_GTM_ATOM8_1.
* To use register names with standard convension, please use SRC_GTM_ATOM8_1.
*/
#define SRC_GTMATOM81 (SRC_GTM_ATOM8_1)

/** \brief F78, ATOM8 Shared Service Request 2 */
#define SRC_GTM_ATOM8_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F78u)
/** Alias (User Manual Name) for SRC_GTM_ATOM8_2.
* To use register names with standard convension, please use SRC_GTM_ATOM8_2.
*/
#define SRC_GTMATOM82 (SRC_GTM_ATOM8_2)

/** \brief F7C, ATOM8 Shared Service Request 3 */
#define SRC_GTM_ATOM8_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F7Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM8_3.
* To use register names with standard convension, please use SRC_GTM_ATOM8_3.
*/
#define SRC_GTMATOM83 (SRC_GTM_ATOM8_3)

/** \brief FB0, ASCLIN22 Transmit Service Request */
#define SRC_ASCLIN22_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FB0u)
/** Alias (User Manual Name) for SRC_ASCLIN22_TX.
* To use register names with standard convension, please use SRC_ASCLIN22_TX.
*/
#define SRC_ASCLIN22TX (SRC_ASCLIN22_TX)

/** \brief FB4, ASCLIN22 Receive Service Request */
#define SRC_ASCLIN22_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FB4u)
/** Alias (User Manual Name) for SRC_ASCLIN22_RX.
* To use register names with standard convension, please use SRC_ASCLIN22_RX.
*/
#define SRC_ASCLIN22RX (SRC_ASCLIN22_RX)

/** \brief FB8, ASCLIN22 Error Service Request */
#define SRC_ASCLIN22_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FB8u)
/** Alias (User Manual Name) for SRC_ASCLIN22_ERR.
* To use register names with standard convension, please use SRC_ASCLIN22_ERR.
*/
#define SRC_ASCLIN22ERR (SRC_ASCLIN22_ERR)

/** \brief FBC, ASCLIN23 Transmit Service Request */
#define SRC_ASCLIN23_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FBCu)
/** Alias (User Manual Name) for SRC_ASCLIN23_TX.
* To use register names with standard convension, please use SRC_ASCLIN23_TX.
*/
#define SRC_ASCLIN23TX (SRC_ASCLIN23_TX)

/** \brief FC0, ASCLIN23 Receive Service Request */
#define SRC_ASCLIN23_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FC0u)
/** Alias (User Manual Name) for SRC_ASCLIN23_RX.
* To use register names with standard convension, please use SRC_ASCLIN23_RX.
*/
#define SRC_ASCLIN23RX (SRC_ASCLIN23_RX)

/** \brief FC4, ASCLIN23 Error Service Request */
#define SRC_ASCLIN23_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FC4u)
/** Alias (User Manual Name) for SRC_ASCLIN23_ERR.
* To use register names with standard convension, please use SRC_ASCLIN23_ERR.
*/
#define SRC_ASCLIN23ERR (SRC_ASCLIN23_ERR)

/** \brief FD0, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_MCSW0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FD0u)
/** Alias (User Manual Name) for SRC_GTM_MCSW0.
* To use register names with standard convension, please use SRC_GTM_MCSW0.
*/
#define SRC_GTMMCSW0 (SRC_GTM_MCSW0)

